compressible/dpEqn_Semi-Implicit_Inplace_DFIBM/case/system/gas/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 500e-6; // Scale the domain to 500um x 500um x 1000um

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 2)
    (1 0 2)
    (1 1 2)
    (0 1 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 64) simpleGrading (1 1 1)
);

boundary
(
    TOP
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    BOTTOM
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    FRONT
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    BACK
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    LEFT
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    RIGHT
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
);


// ************************************************************************* //
