compressible/dpEqn_Semi-Implicit_Inplace_DFIBM/case/0/gas/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 2.07e6;

boundaryField
{
    TOP
    {
        type            waveTransmissive;
        field           p;
        phi             USn;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        2.07e6;
        lInf            10e-3;
        value           uniform 2.07e6;
    }

    BOTTOM
    {
        type            zeroGradient;
    }

    FRONT
    {
        type            zeroGradient;
    }

    BACK
    {
        type            zeroGradient;
    }

    LEFT
    {
        type            zeroGradient;
    }

    RIGHT
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
